<?php
/**
 *  钉钉配置文件, 支持多应用
 */

return [

    /*
    |-----------------------------------------------------------
    | 公司 ID
    |-----------------------------------------------------------
    */
    'corp_id' => env('DING_CORP_ID'),

    /*
    |-----------------------------------------------------------
    | 是否开启 debug，开启后会记录 api 请求和返回数据
    |-----------------------------------------------------------
    */
    'debug' => env('DING_DEBUG', false),

    /*
    |-----------------------------------------------------------
    | 默认钉钉应用, 取下方 agents 里的值
    |-----------------------------------------------------------
    */
    'default' => env('DING_DEFAULT_AGENT', 'beauty'),

    /*
    |-----------------------------------------------------------
    | 加解密
    |-----------------------------------------------------------
    | 此处的 `token` 和 `aes_key` 用于事件通知的加解密
    | 如果你用到事件回调功能，需要配置该两项
    */
    'token' => 'uhl3CZbtsmf93bFPanmMenhWwoqbSwPc',
    'aes_key' => 'qZEOmHU2qYYk6n6vqLfi3FAhcp9mGA2kgbfnsXDrGgN',

    /*
    |-----------------------------------------------------------
    | 多钉钉应用的配置
    |-----------------------------------------------------------
    */
    'agents' => [
        'beauty' => [
            'agent_id' => env('DING_DEFAULT_AGENT_ID', ''),
            'app_key' => env('DING_DEFAULT_AGENT_KEY', ''),
            'app_secret' => env('DING_DEFAULT_AGENT_SECRET', '')
        ],
    ],

    /*
    |-----------------------------------------------------------
    | 机器人
    |-----------------------------------------------------------
    */
    'robots' => [
        'robot_name' => [
           'token' => '',
            'secret' => ''
        ]
    ]
];